#include <iostream>
#include <math.h>
#include <locale.h>

// создадим функцию для вычисления остатка от деления чисел с плавающей запятой

/**float float_mod(float m, float b)
{
    // пример
    // return m - b * (std::floorf(m / b));
    //
    // m = 7,5
    // b = 2
    // m/b = 3.75
    // floor(m/b) = 3
    // b*floor(m/b) = 6
    // m - b*floor(m/b) = 1.5
    return m - b * (std::floorf(m / b));**/

int main(int argc, char *arv[])
{
    setlocale(LC_ALL, "Russian");
    // приветствие, записать что у нас квадрат и что те треугольнтики равнобедренные! + вывод фигуры символами
    std::cout << "Приветвую! Это лабораторная работа №2 Калюжной М.И. Вариант 1_25_Б  начало работы 19.09.23 конец 26.09." << std::endl;
    // tut figura simwolami

    std::cout << "                                  /@\\         /@|                               " << std::endl;
    std::cout << "                                  (&,#\\     /#*%#                               " << std::endl;
    std::cout << "                                  (&,  \\%%@/.,*%#                               " << std::endl;
    std::cout << "                                  (&,   .%,,*/*%#                               " << std::endl;
    std::cout << "                                  (&,   .%,*//*%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*//*%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*//*%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*//*%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*/**%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*/,,%#                               " << std::endl;
    std::cout << "                                  (&,   .&,*//*%#                               " << std::endl;
    std::cout << "      \\&&&&%&&&%&&&&&&&&&&&&&&&&&&&&/   .&,**,/&&%&&&&&&&&&&&&&&&%&&%&&&&&%&/   " << std::endl;
    std::cout << "        \\#%,*///////*///////*/////*.,#@(.%.*&&,                        *@%/     " << std::endl;
    std::cout << "          \\#&(,*,///*///////////////*,./&@@(.                        /@#/       " << std::endl;
    std::cout << "          /%&(,,,//*//////*////*///****(@&@(.                        *&#\\       " << std::endl;
    std::cout << "        /%#.,**/////*///////////*/*,/%&*.%.,&&*                        ,@#\\     " << std::endl;
    std::cout << "      /%%%########################%&/*,*/%.   *&%#########################%%\\   " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&//**/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&///*/%.   .%#                               " << std::endl;
    std::cout << "                                  (&/,,/&&@*  .%#                               " << std::endl;
    std::cout << "                                  (&*/&#.  (&(,%#                               " << std::endl;
    std::cout << "                                  /@&/       *&@#                               " << std::endl;
    std::cout << "                                  |/           \\|                               " << std::endl;

    std::cout << "\n Данная фигура вписана в квадрат с высотой Н, все треуголики в фигуре равнобедренные, имеют основание а и боковые стороны, равные а/sqrt(2), причем (H>=a)." << std::endl;
    std::cout << "Введенные значения а и Н должны удовлетворять таким условиям: H >= a >= 0 \n";
    std::cout << "Данная фигура в условиях данной задачи будет отражена только относительно оси ОХ (т.е. только вертикально) \n";
    std::cout << "Введите H, a, x, y:" << std::endl;